# Brewfile
# utilities
brew 'zsh'
brew 'tmux'
brew 'jq'        # JSON
brew 'python-yq' # Yaml
brew 'bash'
brew 'bash-completion'
brew 'rmtrash'
brew 'htop'
brew 'nkf'
brew 'iperf'

# Development tools
brew 'wget'
brew 'openssl'
brew 'nmap'
brew 'telnet'
brew 'tree'
brew 'kubectx'
brew 'editorconfig'
brew 'tig'
brew 'fn'

# Cloud management tools
## + AWS
  brew 'awscli'

# Provisioning
  brew 'terraform'
  brew 'packer'
  brew 'ansible'

# Cask
  # Google
  cask 'google-chrome'
  cask 'google-japanese-ime'
  cask 'google-drive-file-stream'
  # Development
  cask 'visual-studio-code'
  # Utilitiy
  cask 'slack'
  cask 'skype'
  cask 'firefox'
  cask 'vivaldi'
  cask 'vlc'
  cask 'skitch'
  cask 'boostnote'
  cask 'cheatsheet'
  cask 'iterm2'
  cask 'dropbox'
  cask 'the-unarchiver'
  cask 'karabiner-elements'
  cask 'appcleaner'
  cask 'paragon-ntfs'
  cask 'homebrew/cask-versions/docker-edge'
  cask 'sourcetree'

# Mac App Store
brew 'mas'
  mas 'TweetDeck', id: 485812721
  mas 'The Unarchiver', id: 425424353
  mas 'LINE', id: 539883307
  mas 'trello', id: 1278508951
  mas 'BetterSnapTool', id: 417375580
  mas 'slack', id: 803453959
  mas 'Parallels Client', id: 600925318
  mas 'iMazing HEIC Converter', id: 1292198261
  mas 'ZIPANG' , id: 882655968
