# Brewfile
# utilities
#brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'jq'        # JSON
brew 'python-yq' # Yaml
#brew 'bash'
#brew 'bash-completion'
brew 'rmtrash'
brew 'htop'
brew 'nkf'
brew 'iperf'
#brew 'ag'
brew 'mas'

# Development tools
brew 'wget'
#brew 'openssl'
brew 'nmap'
brew 'telnet'
brew 'tree'
#brew 'kubectx'
#brew 'editorconfig'
#brew 'tig'
#brew 'fn'
brew 'gh'
brew 'expect'

# Cloud management tools
## + AWS
 # brew 'awscli'

# Provisioning
  #brew 'terraform'
  #brew 'packer'
  #brew 'ansible'

# Cask
  #cask 'skitch'
  #cask 'boostnote'
  #cask 'paragon-ntfs'
  #cask 'cheatsheet'
  cask 'amazon-music'
  cask 'anydesk'
  cask 'appcleaner'
  cask 'atom'
  cask 'box'
  cask 'dropbox'
  cask 'firefox'
  cask 'google-chrome'
  cask 'google-drive-file-stream'
  cask 'google-japanese-ime'
  cask 'homebrew/cask-versions/docker-edge'
  cask 'iterm2'
  cask 'karabiner-elements'
  cask 'microsoft-auto-update'
  cask 'microsoft-edge'
  cask 'microsoft-teams'
  cask 'mysqlworkbench'
  cask 'skype'
  cask 'slack'
  cask 'sourcetree'
  cask 'ssh-tunnel-manager'
  cask 'teamviewer'
  cask 'the-unarchiver'
  cask 'tunnelblick'
  cask 'visual-studio-code'
  cask 'vivaldi'
  cask 'vlc'

# Mac App Store
brew 'mas'
  mas 'TweetDeck', id: 485812721
  #mas 'The Unarchiver', id: 425424353
  mas 'LINE', id: 539883307
  mas 'trello', id: 1278508951
  mas 'BetterSnapTool', id: 417375580
  #mas 'slack', id: 803453959
  mas 'Parallels Client', id: 600925318
  mas 'iMazing HEIC Converter', id: 1292198261
  mas 'ZIPANG' , id: 882655968
